In [1]:
import pandas as pd

In [2]:
customers_df = pd.read_csv('.\\data\\2_6_customers.csv', index_col=0)
customers_df

   customer_id     name     surname
0          213    Luiza     Walczak
1          485   Blanka  Kalinowska
2          769  Jaromir    Majewski
3          304    Józef   Olszewski

In [3]:
items_df = pd.read_csv(".\\data\\2_6_items.csv", index_col=0)
items_df

  item_id            name  price
0  ITEM-1     Elite Melon  10.59
1  ITEM-2  Wild Pineapple   5.79
2  ITEM-3      Beast Pear   2.99

In [4]:
orders_df = pd.read_csv(".\\data\\2_6_orders.csv", index_col=0)

In [6]:
orders_df

   customer_id item_id             datetime
0          485  ITEM-1  2019-07-14 16:00:00
1          769  ITEM-1  2019-03-25 07:00:00
2          769  ITEM-3  2019-04-10 07:00:00
3          485  ITEM-1  2019-04-11 01:00:00
4          769  ITEM-2  2019-06-03 14:00:00
5          485  ITEM-3  2019-06-14 18:00:00
6          769  ITEM-3  2019-04-08 00:00:00
7          769  ITEM-2  2018-04-17 03:00:00
8          769  ITEM-2  2018-07-02 19:00:00
9          213  ITEM-1  2019-05-23 11:00:00

In [7]:
items_df.set_index("item_id", inplace=True)
items_df

                   name  price
item_id
ITEM-1      Elite Melon  10.59
ITEM-2   Wild Pineapple   5.79
ITEM-3       Beast Pear   2.99

In [9]:
customers_df.set_index("customer_id", inplace=True)
customers_df

                name     surname
customer_id
213            Luiza     Walczak
485           Blanka  Kalinowska
769          Jaromir    Majewski
304            Józef   Olszewski

In [11]:
items_df

                   name  price
item_id
ITEM-1      Elite Melon  10.59
ITEM-2   Wild Pineapple   5.79
ITEM-3       Beast Pear   2.99

In [10]:
items_df.set_index("item_id", inplace=True)
items_df

KeyError: "None of ['item_id'] are in the columns"

In [12]:
orders_df.join(customers_df, on="customer_id")

   customer_id item_id             datetime     name     surname
0          485  ITEM-1  2019-07-14 16:00:00   Blanka  Kalinowska
1          769  ITEM-1  2019-03-25 07:00:00  Jaromir    Majewski
2          769  ITEM-3  2019-04-10 07:00:00  Jaromir    Majewski
3          485  ITEM-1  2019-04-11 01:00:00   Blanka  Kalinowska
4          769  ITEM-2  2019-06-03 14:00:00  Jaromir    Majewski
5          485  ITEM-3  2019-06-14 18:00:00   Blanka  Kalinowska
6          769  ITEM-3  2019-04-08 00:00:00  Jaromir    Majewski
7          769  ITEM-2  2018-04-17 03:00:00  Jaromir    Majewski
8          769  ITEM-2  2018-07-02 19:00:00  Jaromir    Majewski
9          213  ITEM-1  2019-05-23 11:00:00    Luiza     Walczak

In [13]:
customers_items_df = orders_df.groupby(["customer_id", "item_id"]).count()
customers_items_df

                     datetime
customer_id item_id
213         ITEM-1          1
485         ITEM-1          2
            ITEM-3          1
769         ITEM-1          1
            ITEM-2          3
            ITEM-3          2

In [14]:
customers_items_df.rename(columns={"datetime": "no_orders"},
                          inplace=True)

In [15]:
customers_items_df.reset_index(inplace=True)
customers_items_df.set_index("customer_id",
                             inplace=True,
                             drop=True)
customers_items_df

            item_id  no_orders
customer_id
213          ITEM-1          1
485          ITEM-1          2
485          ITEM-3          1
769          ITEM-1          1
769          ITEM-2          3
769          ITEM-3          2

In [18]:
for item_id in items_df.index.unique():
    item_orders_df = customers_items_df.query("item_id == @item_id")
    customers_df = customers_df \
        .join(item_orders_df["no_orders"], how="left") \
        .rename(columns={"no_orders": item_id})
    
customers_df

                name     surname  ITEM-1  ITEM-2  ITEM-3
customer_id
213            Luiza     Walczak     1.0     NaN     NaN
485           Blanka  Kalinowska     2.0     NaN     1.0
769          Jaromir    Majewski     1.0     3.0     2.0
304            Józef   Olszewski     NaN     NaN     NaN

In [19]:
customers_df.fillna(0.0)

                name     surname  ITEM-1  ITEM-2  ITEM-3
customer_id
213            Luiza     Walczak     1.0     0.0     0.0
485           Blanka  Kalinowska     2.0     0.0     1.0
769          Jaromir    Majewski     1.0     3.0     2.0
304            Józef   Olszewski     0.0     0.0     0.0